## Tasks

### 1. Read the data from the CSV file into a DataFrame and display the first five rows.

In [1]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt
exam_file = 'exams.csv'

In [27]:
df = pd.read_csv(exam_file)
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

### 2. Display the basic information for the DataFrame and its columns using the info() method

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

### 3. Display statistical information for the math score, reading score, and writing score columns using the describe() method.

In [4]:
df[['math score', 'reading score', 'writing score']].describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

### 4. Group the data by the race/ethnicity column and display the mean scores.

In [9]:
mean_scores = df.groupby(['race/ethnicity'])[['math score', 'reading score', 'writing score']].mean() 
mean_scores

                math score  reading score  writing score
race/ethnicity
group A          61.629213      64.674157      62.674157
group B          63.452632      67.352632      65.600000
group C          64.463950      69.103448      67.827586
group D          67.362595      70.030534      70.145038
group E          73.821429      73.028571      71.407143

### 5. Display a single column as a DataFrame with bracket notation.

In [11]:
df[['lunch']]

            lunch
0        standard
1        standard
2        standard
3    free/reduced
4        standard
..            ...
995      standard
996  free/reduced
997  free/reduced
998      standard
999  free/reduced

[1000 rows x 1 columns]

### 6. Display a single column as a Series with bracket notation.

In [13]:
df['lunch']

0          standard
1          standard
2          standard
3      free/reduced
4          standard
           ...
995        standard
996    free/reduced
997    free/reduced
998        standard
999    free/reduced
Name: lunch, Length: 1000, dtype: object

### 7. Display a single column as a Series with dot notation.

In [14]:
df.lunch

0          standard
1          standard
2          standard
3      free/reduced
4          standard
           ...
995        standard
996    free/reduced
997    free/reduced
998        standard
999    free/reduced
Name: lunch, Length: 1000, dtype: object

### 8. Display only rows for females with a math score greater than or equal to 90.

In [26]:
filtered_df = df[(df['gender'] == 'female') & (df['math score'] > 90)]
filtered_df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
114,female,group E,bachelor's degree,standard,completed,99,100,100
165,female,group C,bachelor's degree,standard,completed,96,100,100
179,female,group D,some high school,standard,completed,97,100,100
263,female,group E,high school,standard,none,99,93,90
451,female,group E,some college,standard,none,100,92,97
458,female,group E,bachelor's degree,standard,none,100,100,100
501,female,group B,associate's degree,standard,completed,94,87,92
503,female,group E,associate's degree,standard,completed,95,89,92
521,female,group C,associate's degree,standard,none,91,86,84
546,female,group A,some high school,standard,completed,92,100,97
566,female,group E,bachelor's degree,free/reduced,completed,92,100,100
594,female,group C,bachelor's degree,standard,completed,92,100,99
685,female,group E,master's degree,standard,completed,94,99,100
712,female,group D,some college,standard,none,98,100,99
717,female,group C,associate's degree,standard,completed,96,96,99
855,female,group B,bachelor's degree,standard,none,97,97,96
886,female,group E,associate's degree,standard,completed,93,100,95
903,female,group D,bachelor's degree,free/reduced,completed,93,100,100
957,female,group D,master's degree,standard,none,92,100,100
962,female,group E,associate's degree,standard,none,100,100,100
979,female,group C,associate's degree,standard,none,91,95,94

## Questions

### 1. Does taking a test preparation course improve average scores?

In [36]:
prep = df[df['test preparation course'] == 'completed'][['math score', 'reading score', 'writing score']].mean()
nprep =df[df['test preparation course'] == 'none'][['math score', 'reading score', 'writing score']].mean()

math score       69.695531
reading score    73.893855
writing score    74.418994
dtype: float64

In [37]:
nprep

math score       64.077882
reading score    66.534268
writing score    64.504673
dtype: float64

### 2. Which gender is better on average at math?

In [47]:
# Group by 'gender' and calculate the mean of 'math score'
average_math_score_by_gender = df.groupby('gender')['math score'].mean()

# Display the result
average_math_score_by_gender

gender
female    63.633205
male      68.728216
Name: math score, dtype: float64

In [48]:
if average_math_score_by_gender['male'] > average_math_score_by_gender['female']:
    print("Males perform better on average in math.")
elif average_math_score_by_gender['male'] < average_math_score_by_gender['female']:
    print("Females perform better on average in math.")
else:
    print("Both genders perform equally on average in math.")

Males perform better on average in math.

### 3. Which gender is better on average at all three subjects? Hint: Start by adding a column to the DataFrame with the total score.

In [53]:
df['total score'] = df['math score'] + df['reading score'] + df['writing score']
average_total_score_by_gender = df.groupby('gender')['total score'].mean()
average_total_score_by_gender

gender
female    208.708494
male      197.512448
Name: total score, dtype: float64

### 4. Does the parents’ level of education have an effect on the average scores?

In [54]:
# Group by 'parental level of education' and calculate mean scores
average_scores_by_parental_education = df.groupby('parental level of education')[['math score', 'reading score', 'writing score']].mean()

# Display the result
average_scores_by_parental_education

                             math score  reading score  writing score
parental level of education
associate's degree            67.882883      70.927928      69.896396
bachelor's degree             69.389831      73.000000      73.381356
high school                   62.137755      64.704082      62.448980
master's degree               69.745763      75.372881      75.677966
some college                  67.128319      69.460177      68.840708
some high school              63.497207      66.938547      64.888268